Tekla.Structures.Catalogs.RebarHeaderItem
The RebarHeaderItem class represents an item in the header of the rebar catalog
(rebar_database.inp).

Tekla.Structures.Catalogs.RebarHeaderItem.#ctor
Initializes a new instance of the Tekla.Structures.Catalogs.RebarHeaderItem class.

Tekla.Structures.Catalogs.RebarHeaderItem.PropertyName
Gets or sets the property name.

Tekla.Structures.Catalogs.RebarHeaderItem.Name
Gets or sets the name.

Tekla.Structures.Catalogs.RebarHeaderItem.Type
Gets or sets the type.

Tekla.Structures.Catalogs.RebarHeaderItem.Units
Gets or sets the units.